controllers/FeaturedController.php

SELECT `fk_dimension_time`, `tables_value`, `year`, `fk_dimension_province` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` WHERE fk_dimension_province = 17 GROUP BY `year`
---
    public function actionPoverty()
    {
        $data = \app\models\Tables::find()
            ->select(['fk_dimension_time', 'tables_value', 'year', 'fk_dimension_province'])
            ->joinWith('dimensiontimee')
            ->groupBy('year')
            ->where('fk_dimension_province = 17')
            ->asArray()
            ->all();

SELECT `fk_dimension_time`, CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN ROUND(AVG(tables_value), 2) ELSE NULL END AS `tables_value`, `year`, `fk_dimension_province`, `title`, `fk_dimension_title`, `unit` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` LEFT JOIN `dimension_title` ON `tables`.`fk_dimension_title` = `dimension_title`.`id_dimension_title` LEFT JOIN `dimension_unit` ON `tables`.`fk_dimension_unit` = `dimension_unit`.`id_dimension_unit` WHERE fk_dimension_title = '7' GROUP BY `year`
---
    public function actionGetdata($variable)
    {
        $data = \app\models\Tables::find()
            ->select([
                'fk_dimension_time',
                'CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN ROUND(AVG(tables_value), 2) ELSE NULL END as tables_value', // Round the average value to 2 decimals
                'year',
                'fk_dimension_province',
                'title',
                'fk_dimension_title',
                'unit'
            ])
            ->joinWith(['dimensiontimee', 'dimensiontitlee', 'dimensionunite'])
            ->groupBy(['year'])
            ->where('fk_dimension_title = :variable', [':variable' => $variable])
            ->asArray()
            ->all();

SELECT `fk_dimension_time`, CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN ROUND(AVG(tables_value), 2) ELSE NULL END AS `tables_value`, `year`, `fk_dimension_province`, `title`, `fk_dimension_title`, `unit`, `province_name` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` LEFT JOIN `dimension_title` ON `tables`.`fk_dimension_title` = `dimension_title`.`id_dimension_title` LEFT JOIN `dimension_unit` ON `tables`.`fk_dimension_unit` = `dimension_unit`.`id_dimension_unit` LEFT JOIN `dimension_province` ON `tables`.`fk_dimension_province` = `dimension_province`.`id_dimension_province` WHERE (fk_dimension_title = '5') AND (`year`='2023') AND (NOT (`tables_value` IS NULL)) GROUP BY `fk_dimension_province`
---
    public function actionGetdatapie($variable, $year)
    {
        $data = \app\models\Tables::find()
            ->select([
                'fk_dimension_time',
                'CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN ROUND(AVG(tables_value), 2) ELSE NULL END as tables_value', // Round the average value to 2 decimals
                'year',
                'fk_dimension_province',
                'title',
                'fk_dimension_title',
                'unit',
                'province_name'
            ])
            ->joinWith(['dimensiontimee', 'dimensiontitlee', 'dimensionunite', 'dimensionprovincee'])
            ->groupBy(['fk_dimension_province'])
            ->where('fk_dimension_title = :variable', [':variable' => $variable])
            ->andWhere(['year' => $year])  // Add filter for year
            ->andWhere(['NOT', ['tables_value' => null]])  // Ensure tables_value is not null
            ->asArray()
            ->all();

SELECT `fk_dimension_time`, CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN AVG(tables_value) ELSE NULL END AS `tables_value`, `year`, `fk_dimension_province`, `title`, `fk_dimension_title`, `unit` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` LEFT JOIN `dimension_title` ON `tables`.`fk_dimension_title` = `dimension_title`.`id_dimension_title` LEFT JOIN `dimension_unit` ON `tables`.`fk_dimension_unit` = `dimension_unit`.`id_dimension_unit` WHERE `fk_dimension_title` IN ('4', '5', '7') GROUP BY `year`, `fk_dimension_title`
---
    public function actionGetdatamulti($variable)
    {
        $variableArray = explode(',', $variable);

        // Fetch the data
        $data = \app\models\Tables::find()
            ->select([
                'fk_dimension_time',
                'CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN AVG(tables_value) ELSE NULL END as tables_value',
                'year',
                'fk_dimension_province',
                'title',
                'fk_dimension_title',
                'unit'
            ])
            ->joinWith(['dimensiontimee', 'dimensiontitlee', 'dimensionunite'])
            ->where(['fk_dimension_title' => $variableArray])
            ->groupBy(['year', 'fk_dimension_title'])
            ->asArray()
            ->all();

SELECT `fk_dimension_time`, CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN AVG(tables_value) ELSE NULL END AS `tables_value`, `year`, `fk_dimension_province`, `province_highchart_code`, `title`, `fk_dimension_title`, `province_name`, `unit` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` LEFT JOIN `dimension_title` ON `tables`.`fk_dimension_title` = `dimension_title`.`id_dimension_title` LEFT JOIN `dimension_unit` ON `tables`.`fk_dimension_unit` = `dimension_unit`.`id_dimension_unit` LEFT JOIN `dimension_province` ON `tables`.`fk_dimension_province` = `dimension_province`.`id_dimension_province` WHERE (`fk_dimension_title`='4') AND (`year`='2024') GROUP BY `fk_dimension_province`
---
    public function actionGetdatamap($variable, $year)
    {
        $data = \app\models\Tables::find()
            ->select([
                'fk_dimension_time',
                'CASE WHEN COUNT(tables_value) > 0 AND SUM(CASE WHEN tables_value IS NOT NULL THEN 1 ELSE 0 END) > 0 THEN AVG(tables_value) ELSE NULL END as tables_value',
                'year',
                'fk_dimension_province',
                'province_highchart_code',
                'title',
                'fk_dimension_title',
                'province_name',
                'unit'
            ])
            ->joinWith(['dimensiontimee', 'dimensiontitlee', 'dimensionunite', 'dimensionprovincee'])
            ->where(['fk_dimension_title' => $variable, 'year' => $year])  // Add filter for year
            ->groupBy(['fk_dimension_province'])
            ->asArray()
            ->all();