controllers/SiteController.php

    public function actionIndex()
    {
        $data = \app\models\Tables::find()
            ->select(['fk_dimension_time', 'tables_value', 'year', 'fk_dimension_province'])
            ->joinWith('dimensiontimee')
            ->groupBy('year')
            ->where('fk_dimension_province = 17')
            ->asArray()
            ->all();
---
SELECT `fk_dimension_time`, `tables_value`, `year`, `fk_dimension_province` FROM `tables` LEFT JOIN `dimension_time` ON `tables`.`fk_dimension_time` = `dimension_time`.`id_dimension_time` WHERE fk_dimension_province = 17 GROUP BY `year`